STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_HeartRateThreadX/STM32_WPAN/App/app_ble.c
uint64_t buffer_nvm[CFG_BLEPLAT_NVM_MAX_SIZE] = {0};

static AMM_VirtualMemoryCallbackFunction_t APP_BLE_ResumeFlowProcessCb;

/* Host stack init variables */
static uint32_t buffer[DIVC(BLE_DYN_ALLOC_SIZE, 4)];
static uint32_t gatt_buffer[DIVC(BLE_GATT_BUF_SIZE, 4)];
static BleStack_init_t pInitParams;

static TX_THREAD        BleHostTaskHandle;

static TX_THREAD        HciAsyncEvtTaskHandle;
static TX_SEMAPHORE     HciAsyncEvtSemaphore;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
TX_SEMAPHORE          BleHostSemaphore;
TX_SEMAPHORE          GapProcCompleteSemaphore;

/* USER CODE BEGIN GV */

/* ADV_LP_REQ_TASK related resources */
TX_THREAD ADV_LP_REQ_Thread;
TX_SEMAPHORE ADV_LP_REQ_Thread_Sem;

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static void BleStack_Process_BG(void);
static void Ble_UserEvtRx(void);
static void BLE_ResumeFlowProcessCallback(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress(void);
static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);
static void BLE_NvmCallback (SNVMA_Callback_Status_t);
static uint8_t HOST_BLE_Init(void);
static void BLE_HOST_Task_Entry(ULONG lArgument);
static void HciAsyncEvt_Task_Entry(ULONG lArgument);
/* USER CODE BEGIN PFP */
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t*p_bd_addr);
static void APP_BLE_AdvLowPower_Entry(unsigned long thread_input);
static void APP_BLE_AdvLowPower_timCB(void *arg);
static void APP_BLE_AdvLowPower(void);
/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  /* USER CODE BEGIN APP_BLE_Init_1 */

  /* USER CODE END APP_BLE_Init_1 */

  LST_init_head(&BleAsynchEventQueue);

  UINT TXstatus;
  CHAR *pStack;

  /* Create BLE Host ThreadX objects */

  TXstatus = tx_byte_allocate(pBytePool, (void **)&pStack, TASK_STACK_SIZE_BLE_HOST, TX_NO_WAIT);

  if( TXstatus == TX_SUCCESS )
  {
    TXstatus = tx_thread_create(&BleHostTaskHandle, "BLE Host Task", BLE_HOST_Task_Entry, 0,
                                 pStack, TASK_STACK_SIZE_BLE_HOST,
                                 TASK_PRIO_BLE_HOST, TASK_PREEMP_BLE_HOST,
                                 TX_NO_TIME_SLICE, TX_AUTO_START);

    TXstatus |= tx_semaphore_create(&BleHostSemaphore, "BLE Host Semaphore", 0);
  }

  if( TXstatus != TX_SUCCESS )
  {
    LOG_ERROR_APP( "BLE Host ThreadX objects creation FAILED, status: %d", TXstatus);
    Error_Handler();
  }

  TXstatus = tx_byte_allocate(pBytePool, (void **)&pStack, TASK_STACK_SIZE_HCI_ASYNC_EVENT, TX_NO_WAIT);

  if( TXstatus == TX_SUCCESS )
  {
    TXstatus = tx_thread_create(&HciAsyncEvtTaskHandle, "HCI Async Event Task", HciAsyncEvt_Task_Entry, 0,
                                 pStack, TASK_STACK_SIZE_HCI_ASYNC_EVENT,
                                 TASK_PRIO_HCI_ASYNC_EVENT, TASK_PREEMP_HCI_ASYNC_EVENT,
                                 TX_NO_TIME_SLICE, TX_AUTO_START);

    TXstatus |= tx_semaphore_create(&HciAsyncEvtSemaphore, "HCI Async Event Semaphore", 0);
  }

  if( TXstatus != TX_SUCCESS )
  {
    LOG_ERROR_APP( "HCI Async Event ThreadX objects creation FAILED, status: %d", TXstatus);
    Error_Handler();
  }

  TXstatus = tx_semaphore_create(&GapProcCompleteSemaphore, "GAP Procedure Completed Semaphore", 0);

  if( TXstatus != TX_SUCCESS )
  {
    LOG_ERROR_APP( "GAP Procedure Completed ThreadX objects creation FAILED, status: %d", TXstatus);
    Error_Handler();
  }

  /* NVM emulation in RAM initialization */
  NVM_Init(buffer_nvm, 0, CFG_BLEPLAT_NVM_MAX_SIZE);

  /* First register the APP BLE buffer */
  SNVMA_Register (APP_BLE_NvmBuffer,
                  (uint32_t *)buffer_nvm,
                  (CFG_BLEPLAT_NVM_MAX_SIZE * 2));

  /* Realize a restore */
  SNVMA_Restore (APP_BLE_NvmBuffer);
  /* USER CODE BEGIN APP_BLE_Init_Buffers */

  /* USER CODE END APP_BLE_Init_Buffers */

  /* Check consistency */
  if (NVM_Get (NVM_FIRST, 0xFF, 0, 0, 0) != NVM_EOF)
  {
    NVM_Discard (NVM_ALL);
  }

  /* Initialize the BLE Host */
  if (HOST_BLE_Init() == 0u)
  {
    /* Initialization of HCI & GATT & GAP layer */
    Ble_Hci_Gap_Gatt_Init();

    /* Initialization of the BLE Services */
    SVCCTL_Init();

    /* Initialization of the BLE App Context */
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    bleAppContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

    /* From here, all initialization are BLE application specific */

    /* USER CODE BEGIN APP_BLE_Init_4 */

    /* USER CODE END APP_BLE_Init_4 */

    /* Initialize Services and Characteristics. */
    LOG_INFO_APP("\n");
    LOG_INFO_APP("Services and Characteristics creation\n");
    HRS_APP_Init();
    DIS_APP_Init();
    LOG_INFO_APP("End of Services and Characteristics creation\n");
    LOG_INFO_APP("\n");

    /* USER CODE BEGIN APP_BLE_Init_3 */
    /* Start to Advertise to accept a connection */
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);

    if (tx_byte_allocate(pBytePool, (void **) &pStack, ADV_LP_REQ_TASK_STACK_SIZE,TX_NO_WAIT) != TX_SUCCESS)
    {
      Error_Handler();
    }
    if (tx_semaphore_create(&ADV_LP_REQ_Thread_Sem, "ADV_LP_REQ_Thread_Sem", 0)!= TX_SUCCESS )
    {
      Error_Handler();
    }
    if (tx_thread_create(&ADV_LP_REQ_Thread, "ADV_LP_REQ_Thread", APP_BLE_AdvLowPower_Entry, 0,
                           pStack, ADV_LP_REQ_TASK_STACK_SIZE,
                           ADV_LP_REQ_TASK_PRIO, ADV_LP_REQ_TASK_PREEM_TRES,
                           TX_NO_TIME_SLICE, TX_AUTO_START) != TX_SUCCESS)
    {
      Error_Handler();
    }

    /**
    * Create timer to enter Low Power Advertising
    */
    UTIL_TIMER_Create(&(bleAppContext.TimerAdvLowPower_Id),
                      ADV_TIMEOUT_MS,
                      UTIL_TIMER_ONESHOT,
                      &APP_BLE_AdvLowPower_timCB, 0);
    UTIL_TIMER_Start(&(bleAppContext.TimerAdvLowPower_Id));
    /* USER CODE END APP_BLE_Init_3 */

